tutorials/heatTransfer/chtMultiRegionSimpleFoam/cpuCabinet/system/v_CPU/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          fvOptions;
    location        "system";
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

v_CPU_AbsoluteEnergySource
{
    type            scalarSemiImplicitSource;
    active          true;

    scalarSemiImplicitSourceCoeffs
    {
        selectionMode   cellZone;
        cellZone        v_CPU;
        volumeMode      absolute;

        injectionRateSuSp
        {
            h           ( 100 0 );
        }
    }
}

// ************************************************************************* //
